netify-soap/src/test/resources/soap/requests/role/GetRoleByIdRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetRoleByIdRequest>
            <gen:id>2540</gen:id>
        </gen:GetRoleByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>